InformationRegisters/ИсторияОтправкиСообщенийВ1СДокументооборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОтправкиСообщенийВ1СДокументооборот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияОтправкиСообщенийВ1СДокументооборот/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Идентификатор = Строка(Запись.Идентификатор);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИсторияОтправкиСообщенийВ1СДокументооборот.Данные КАК Данные
		|ИЗ
		|	РегистрСведений.ИсторияОтправкиСообщенийВ1СДокументооборот КАК ИсторияОтправкиСообщенийВ1СДокументооборот
		|ГДЕ
		|	ИсторияОтправкиСообщенийВ1СДокументооборот.Идентификатор = &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор", Запись.Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные = Выборка.Данные.Получить();
		Если СтрДлина(Данные) <> 0 Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			Данные.Записать(ИмяВременногоФайла);
			
			ФайлСДанными = Новый Файл(ИмяВременногоФайла);
			Размер = ФайлСДанными.Размер() / 1024;	// Кб
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
			ТекстСообщения = ТекстовыйДокумент.ПолучитьТекст();
			УдалитьФайлы(ИмяВременногоФайла);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
